app/controllers/courses_controller.rb

INSERT INTO "courses" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dsfsfs"], ["description", "sfsfs"], ["created_at", "2023-09-26 12:30:52.871085"], ["updated_at", "2023-09-26 12:30:52.871085"]]
---
  def create
    @course = Course.new(course_params)
    authorize @course
    @course.user = current_user

    respond_to do |format|
      if @course.save